Revit 2015 API
RenderNode Class
 This is a base class representing a render node in a model-exporting process.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
Since: 2014
Syntax
C#
public class RenderNode : IDisposable
Visual Basic
Public Class RenderNode _
	Implements IDisposable
Visual C++
public ref class RenderNode : IDisposable
Remarks
 A node can be both geometric (such as an element, light, etc.) or non-geometric (e.g. material). Some types of nodes are container modes, which include other render nodes.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.RenderNode
 Autodesk.Revit.DB.ContentNode
 Autodesk.Revit.DB.FaceNode
 Autodesk.Revit.DB.GroupNode
 Autodesk.Revit.DB.MaterialNode
 Autodesk.Revit.DB.ViewNode
See Also
RenderNode Members
Autodesk.Revit.DB Namespace